; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph7 - mode
	infrared5 - mode
	infrared0 - mode
	spectrograph4 - mode
	infrared3 - mode
	infrared2 - mode
	thermograph6 - mode
	image1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 thermograph6)
	(supports instrument0 image1)
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph7)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared5)
	(supports instrument1 infrared0)
	(supports instrument1 infrared3)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
)
(:goal (and
	(have_image Phenomenon5 infrared5)
	(have_image Planet6 thermograph6)
	(have_image Phenomenon7 infrared3)
	(have_image Phenomenon7 infrared0)
	(have_image Star8 infrared5)
	(have_image Star8 spectrograph7)
	(have_image Planet9 image1)
	(have_image Planet9 infrared0)
	(have_image Planet10 infrared3)
))

)

; plan
1. (turn_to satellite0 star3 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star3)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 star8 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star8)
   goals met: 0 of 9
5. (take_image satellite0 star8 instrument0 spectrograph7)
   added: (have_image star8 spectrograph7)
   goals met: 1 of 9
6. (turn_to satellite0 planet9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet9)
   goals met: 1 of 9
7. (take_image satellite0 planet9 instrument0 image1)
   added: (have_image planet9 image1)
   goals met: 2 of 9
8. (turn_to satellite0 planet6 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet6)
   goals met: 2 of 9
9. (take_image satellite0 planet6 instrument0 thermograph6)
   added: (have_image planet6 thermograph6)
   goals met: 3 of 9
10. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 9
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 9
12. (turn_to satellite0 star4 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star4)
   goals met: 3 of 9
13. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 3 of 9
14. (turn_to satellite0 phenomenon5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 9
15. (take_image satellite0 phenomenon5 instrument1 infrared5)
   added: (have_image phenomenon5 infrared5)
   goals met: 4 of 9
16. (turn_to satellite0 phenomenon7 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon7)
   goals met: 4 of 9
17. (take_image satellite0 phenomenon7 instrument1 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 5 of 9
18. (take_image satellite0 phenomenon7 instrument1 infrared3)
   added: (have_image phenomenon7 infrared3)
   goals met: 6 of 9
19. (turn_to satellite0 planet10 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet10)
   goals met: 6 of 9
20. (take_image satellite0 planet10 instrument1 infrared3)
   added: (have_image planet10 infrared3)
   goals met: 7 of 9
21. (turn_to satellite0 planet9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet9)
   goals met: 7 of 9
22. (take_image satellite0 planet9 instrument1 infrared0)
   added: (have_image planet9 infrared0)
   goals met: 8 of 9
23. (turn_to satellite0 star8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star8)
   goals met: 8 of 9
24. (take_image satellite0 star8 instrument1 infrared5)
   added: (have_image star8 infrared5)
   goals met: 9 of 9
